Tekla Open API Reference for Tekla Structures 2025
ModelObjectHatchAttributes Class
 The ModelObjectHatchAttributes class contains hatch attributes for model object hatches.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.HatchAttributes
 Tekla.Structures.Drawing.ModelObjectHatchAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ModelObjectHatchAttributes : HatchAttributes
<SerializableAttribute>
Public NotInheritable Class ModelObjectHatchAttributes
	Inherits HatchAttributes
The ModelObjectHatchAttributes type exposes the following members.
Properties
Name | Description
Angle
 The angle in which to draw the hatch.
 (Inherited from HatchAttributes.)
AutomaticScaling
 Specifies whether automatic scaling is enabled. If disabled, custom scale values will be used (see ScaleX and ScaleY).
BackgroundColor
 The background color of the hatch.
 (Inherited from HatchAttributes.)
Color
 The color of the hatch.
 (Inherited from HatchAttributes.)
DrawBackgroundColor
 Sets whether the background color will be enabled or disabled for the hatch. See also: BackgroundColor.
 (Inherited from HatchAttributes.)
FactorType
 The type of the hatch factor.
 (Inherited from HatchAttributes.)
Name
 The name of the hatch. If an empty string is given as hatch name it will become "None".
 (Inherited from HatchAttributes.)
ScaleX
 The scale value of the hatch in the X-direction.
 (Inherited from HatchAttributes.)
ScaleY
 The scale value of the hatch in the Y-direction.
 (Inherited from HatchAttributes.)
TrueBackgroundColor
 The true color (rgb enabled) of the hatch background.
 (Inherited from HatchAttributes.)
TrueColor
 The true color (RGB enabled) of the hatch.
 (Inherited from HatchAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace